DataProcessors/ТаблицаXML_СайтыТребующиеАвтоответаАнкетыНаВопросРегионАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>ТаблицаXML_СайтыТребующиеАвтоответаАнкетыНаВопросРегионАбонента</Name>
			<Comment>Если сайт указан, то в анкете первым становится вопрос не после выбора сайта, а после выбора региона. Т.е. это автоответ не на второй, а на третий вопрос</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сайт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗначения</Name>
					<Comment>Тип значения строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТаблицаXML_СайтыТребующиеАвтоответаАнкетыНаВопросРегионАбонента/Ext/ObjectModule.bsl
Функция УстановитьНастройки() Экспорт
	
	РегистрСведений 	= ?(Не ЗначениеЗаполнено(РегистрСведений), 		"УчетнаяПолитика", 													РегистрСведений);
	Измерение 			= ?(Не ЗначениеЗаполнено(Измерение), 			"Параметр", 														Измерение); 
	Ресурс 				= ?(Не ЗначениеЗаполнено(Ресурс), 				"Значение", 														Ресурс);
	ЗначениеИзмерения 	= ?(Не ЗначениеЗаполнено (ЗначениеИзмерения), 	"СайтыТребующиеАвтоответаАнкетыНаВопросРегионАбонента", 			ЗначениеИзмерения)
КонецФункции

Функция ПолучиТекстИзРегистра() Экспорт	
	ЗначениеПоУмолчанию = "";
	
	Запрос = Новый Запрос("ВЫБРАТЬ Значение ИЗ РегистрСведений.УчетнаяПолитика.СрезПоследних(&Период, ) ГДЕ Параметр = &Измерение1"); 
	
	Запрос.Текст = ?(РегистрСведений <> "УчетнаяПолитика", 	 СтрЗаменить(Запрос.Текст, "УчетнаяПолитика", РегистрСведений), Запрос.Текст);
	Запрос.Текст = ?(Измерение <> "Параметр", 				 СтрЗаменить(Запрос.Текст, "Параметр", "Измерение"), 			Запрос.Текст);
	Запрос.Текст = ?(Ресурс <> "Значение",					 СтрЗаменить(Запрос.Текст, "Значение", "Ресурс"), 				Запрос.Текст); 
	
	Запрос.УстановитьПараметр("Период", 	ТекущаяДата());
	Запрос.УстановитьПараметр("Измерение1", ЗначениеИзмерения);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Рез = РезультатЗапроса.Выгрузить()[0][0];	
	Возврат Рез	
КонецФункции

Функция ЗаписатьВУчетнуюПолитику(Период, Параметр, Значение)
	
	НЗ = РегистрыСведений.УчетнаяПолитика.СоздатьНаборЗаписей();
	НЗ.Отбор.Период.Установить(Период);
	НЗ.Отбор.Параметр.Установить(Параметр);
	НЗ.Прочитать();
	
	Новая = НЗ.Добавить();
	Новая.Период 			= Период;
	Новая.Параметр 			= Параметр;
	Новая.ТипЗначения 		= "Строка";
	Новая.Значение 			= Значение;
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		НЗ.Записать();
		Результат = Истина;
	Исключение
		ЗаписьЖурналаРегистрации("Записать параметр учетной политики", УровеньЖурналаРегистрации.Ошибка, СтрШаблон("Период = %1, Параметр = %2, Значение = %3", Период, Параметр, Значение), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Результат = Ложь;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
КонецФункции

Процедура Сериализовать() Экспорт	
		
	Мас = Новый Массив();
	Для Каждого i Из ЭтотОбъект.ТЗ Цикл
		Структ = Новый Структура();
		Структ.Вставить("Cайт", i["Месяц"]);
		Мас.Добавить(Структ);
	КонецЦикла;
	
	
	ЗапXML = Новый ЗаписьXML();
	ЗапXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗапXML, Мас, НазначениеТипаXML.Явное);
	Стр = ЗапXML.Закрыть();

	ЗаписатьВУчетнуюПолитику(ТекущаяДата(), ЭтотОбъект.ЗначениеИзмерения, Стр);
	
КонецПроцедуры

Функция Десериализовать() Экспорт
	//Десериализует в два направления:
	//1. Табличную часть
	//2. Массив
	ЭтотОбъект.ТЗ.Очистить();
	Мас = Новый Массив();
	
	Стр = ПолучиТекстИзРегистра(); 
	Если Стр = "" Тогда
		Возврат Мас
	КонецЕсли;
	
	ЧтXML = Новый ЧтениеXML();
	ЧтXML.УстановитьСтроку(Стр);     
	
	Попытка
		Мас = СериализаторXDTO.ПрочитатьXML(ЧтXML);
	Исключение   
		Возврат Мас;
	КонецПопытки;
	
	Попытка
		Для Каждого i Из Мас Цикл
			Новая = ЭтотОбъект.ТЗ.Добавить();		
			Новая["Сайт"] = i["Сайт"];
		КонецЦикла;
	Исключение 
		Возврат Мас;	
	КонецПопытки;
	
	Возврат Мас;
КонецФункции
